import Link from "next/link";
import "./TermsSale.css";
const TermsSale = () => {
  return (
    <section className="terms-sale-section">
      <div>
        <p>
          المنتجات المعروضة للبيع والتي يتم تسويقها علي موقع
          <a href="https://www.frada.com.sa">Frada.com.sa</a> يتم بيعها وفوترتها
          بواسطة شركة كبار الشخصيات التجارية في المملكة العربية السعودية
        </p>
        <p>
          للتواصل بشأن الشراء أو التسليم يمكن التواصل مع خدمة العملاء عبر البريد
          الإلكتروني أو الهاتف خلال ساعات العمل
        </p>
      </div>
      <div>
        <h4>قبول شروط البيع</h4>
        <p>
          بتقديم طلب عبر موقعنا، يوافق العميل على الالتزام بشروط البيع هذه. وفي
          حال عدم رغبة العميل في الالتزام بهذه الشروط بعد تقديم الطلب، يجب على
          العميل إلغاء الطلب أو إعادة المشتريات وفقًا للسياسات الموضحة.
        </p>
      </div>
      <div>
        <h4>الشروط العامة للبيع</h4>
        <ol>
          <li>
            FRADA تبيع المنتجات للمستهلكين النهائيين للاستخدام الشخصي غير
            التجاري فقط
          </li>
          <li>تعتبر الاتفاقية مكتملة عندما تقبل FRADA الطلب جزئيًا أو كليًا</li>
          <li>
            يجب على العملاء التأكيد على قراءة وفهم جميع الشروط والمعلومات
            المقدمة خلال عملية الشراء
          </li>
        </ol>
      </div>
      <div>
        <h4>كيفية شراء المنتجات</h4>
        <p>
          المنتجات المتاحة للبيع هي تلك المعروضة على الموقع الإلكتروني فقط
          ووفقًا لمعلومات المنتج المحددة الصور المقدمة في شاشة معلومات المنتج هي
          لأغراض إعلامية وقد لا تعكس بدقة جميع خصائص المنتج بسبب الاختلافات في
          الشاشات والأنظمة
        </p>
        <p>
          لأي استفسارات أخرى أو معلومات تفصيلية حول شروط البيع، يرجى الاتصال
          بخدمة العملاء على البريد الإلكتروني customer.care@frada.com أو الهاتف
          من الساعة 8 صباحًا حتى 5 مساءً في أيام العمل.
        </p>
      </div>
      <div>
        <h4>تقديم الطلبات عبر الموقع الإلكتروني</h4>
        <h5>
          يمكن للعميل تقديم طلب شراء عبر موقعنا الإلكتروني من خلال اتباع الخطوات
          التالية:
        </h5>
        <p>
          <span>ملء النموذج:</span>
          <span>
            يجب على العميل ملء نموذج الطلب المتاح على الموقع الإلكتروني بدقة.
          </span>
        </p>
        <p>
          <span>مراجعة الشروط:</span>
          <span>
            يجب أن يقرأ العميل هذه الشروط، ومواصفات المنتج، والسعر المذكور
            &#34; شاملاً الضرائب والرسوم &#34; .
          </span>
        </p>
        <p>
          <span>تكاليف الشحن:</span>
          <span>
            يجب على العميل معرفة تكاليف الشحن وأي تكاليف إضافية قد تنطبق حسب
            طريقة الشحن المختارة
          </span>
        </p>
        <p>
          <span>طلب الفاتورة:</span>
          <span>
            يمكن للعميل طلب استلام فاتورة للمنتجات المشتراة إذا رغب في ذلك
          </span>
        </p>
        <h5>التأكيد على استلام الطلب</h5>
        <p>
          <span>إشعار بالبريد الإلكتروني:</span>
          <span>
            ستقوم فرادا بإرسال رسالة بريد إلكتروني لتأكيد استلام الطلب
          </span>
        </p>
        <p>
          <span>محتويات الإشعار:</span>
          <span>
            سيحتوي البريد الإلكتروني على وصف موجز لشروط الشراء والمعلومات التي
            أدخلها العميل في النموذج. السعر وشروط الدفع
          </span>
        </p>
        <h5>الأسعار وتكاليف الشحن:</h5>
        <p>
          <span>معلومات الأسعار:</span>
          <span>
            الأسعار مدرجة بالريال السعودي ويمكن أن تتغير دون إشعار مسبق.
          </span>
        </p>
        <p>
          <span>توفر المنتج:</span>
          <span>
            المنتجات تخضع للتوفر وفي حالة نفاد المخزون، ستقوم فرادا بإخطار
            العميل دون تحصيل أية رسوم للمنتجات غير المتوفرة.
          </span>
        </p>
        <h5>طرق الدفع</h5>
        <p>
          <span>الوسائل المتاحة:</span>
          <span>يمكن إجراء الدفع باستخدام بطاقة الائتمان أو بايبال.</span>
        </p>
        <p>
          <span>معالجة الدفع:</span>
          <span>ستتم المعالجة من خلال خادم آمن وفقاً لاختيار فرادا.</span>
        </p>
        <h5>أمان المعلومات</h5>
        <p>
          <span>حماية البيانات:</span>
          <span>
            تفاصيل بطاقة الائتمان لا تكشف لفرادا وترسل مباشرةً إلى الجهة المالية
            المعنية.
          </span>
        </p>
        <p>
          <span>المسؤولية عن الاستخدام غير القانوني:</span>
          <span>
            فرادا ليست مسؤولة عن أي استخدامات احتيالية أو غير قانونية لبطاقة
            الائتمان خلال عملية الدفع.
          </span>
        </p>
        <p>
          بهذه الطريقة، تضمن فرادا تجربة شراء آمنة وموثوقة عبر الإنترنت لجميع
          عملائها
        </p>
      </div>
      <div>
        <h4>تسليم المنتجات والتكاليف ذات الصلة</h4>
        <p>
          يجب على فرادا ومورديها ومقدمي خدماتها اللوجستية تسليم المنتجات التي
          اشتراها العميل على العنوان وفي التاريخ المشار إليه في الطلب، بالتكلفة
          الموضحة تحديدًا في الموقع قبل شحن الطلب. على أي حال، في حالة التسليم
          خارج الأراضي المحلية، قد تخضع تكاليف الشحن ومواعيد التسليم للتغييرات
        </p>
        <p>
          مواعيد التسليم التي تشير إليها فرادا هي إرشادية بحتة. أي تأخير في مثل
          هذه الأوقات، أو التسليم الجزئي للمنتج، لا يحق للعميل رفض المنتج
          والمطالبة بالتعويضات أو التعويضات.
        </p>
        <h5>عند تسليم المنتجات، يجب على العميل التأكد مما يلي:</h5>
        <ul>
          <li>يتوافق عدد العناصر المسلمة مع الرقم الموضح في ملصق الشحن.</li>
          <li>
            العبوة سليمة، غير تالفة أو مبللة، ولم تتغير، بما في ذلك مادة ختم
            الشحنة &#34; شريط البيع أو أختام الربط المعدنية &#34; .
          </li>
        </ul>
        <p>
          يجب الإبلاغ فورًا عن أي ضرر يتم اكتشافه في العبوة و/أو المنتج وأي
          تباين موجود في عدد العناصر أو في المؤشرات الواردة في فاتورة الطرود في
          فاتورة الطرود المراد إعادتها إلى شركة الشحن.
        </p>
        <p>
          يجب الإبلاغ عن أي مشكلة تتعلق بسلامة المنتجات المستلمة وعددها
          واكتمالها في غضون 14 يومًا من التسليم ذي الصلة، وفقًا للإجراءات
          المنصوص عليها في هذه الوثيقة.
        </p>
      </div>
      <div>
        <h4>حق الإلغاء</h4>
        <p>
          خلال فترات الذروة، مثل فترات البيع لدينا، قد يكون هناك توافر محدود
          للمخزون. قد يتم إلغاء جزء من طلبك أو الطلب بأكمله بسبب هذا.
        </p>
        <p>
          يمكن لأنظمة الأمان المصرفية وبروتوكولات التحقق من الاحتيال لدينا إيقاف
          المعاملات لمجموعة متنوعة من الأسباب، من تلف البطاقة إلى أمان اتصال
          الإنترنت.
        </p>
      </div>
      <p>يُرجى التأكد من أننا لا نحصل على أي أموال حتى يتم شحن الطلب.</p>
      <p>
        في هذه الحالات، سيرسل فريق خدمة العملاء لدينا بريدًا إلكترونيًا لإعلامك
        بأي تغييرات تطرأ على طلبك.
      </p>
      <p>
        بمجرد تقديم الطلب، يعمل فريقنا بسرعة لتجهيز طلبك وشحنه. لهذا السبب، لا
        يمكننا تفهم/الموافقة على الإلغاءات أو التغييرات في طلبك. يتضمن هذا
        التغييرات على العناصر وتفاصيل الشحن. إذا غيرت رأيك، فيحق لك إرجاع طلبك.
        يمكن الاطلاع على تفاصيل الإرجاع الكاملة باستخدام الرابط التالي:
        <Link href="/services/returns-and-refunds">سياسة الإرجاع</Link>
      </p>
      <p>
        يتطلب أن يكون شأن النقل وتكاليف نقل المنتج/المنتجات -حتى يتلقى العميل
        تأكيدًا بأن المنتج قد تم إرجاعه بشكل صحيح وتسليمه إلى متجر البيع
        بالتجزئة فرادا - على عاتق العميل. لذلك، في حالة تعرض المنتج للتلف أثناء
        النقل، يجب على فرادا إبلاغ العميل بذلك من أجل تمكين الأخير من إرسال
        الشكوى ذات الصلة على الفور إلى شركة الشحن والمطالبة باسترداد الأموال. في
        هذه الحالة، سيتم توفير المنتج للعميل وسيتم إلغاء إشعار الإلغاء
      </p>
      <p>
        لا تتحمل فرادا أي مسؤولية عن المنتجات التالفة أو المسروقة أو المفقودة
        أثناء النقل أو فيما يتعلق بشحنها، عندما تتم معالجة الشحن مرة أخرى إلى
        فرادا وفقًا لإحدى الطرق الموضحة.
      </p>
      <p>
        يجب على فرادا أن تعيد إلى العميل كامل المبلغ الذي دفعه بالفعل ، بما في
        ذلك تكاليف الشحن القياسية التي قد تكبدتها فيما يتعلق بالمنتجات المرتجعة
        &#34; باستثناء أي تكلفة إضافية متكبدة نتيجة اختلاف و / أو أسرع نوع
        الشحن والتسليم &#34;  في غضون 14 &#34; أربعة عشر &#34;  يومًا من تاريخ
        إعادة المنتج إلى فرادا. ما لم يتفق الطرفان على خلاف ذلك، سيتم شطب المبلغ
        الذي تم تحصيله في البداية من العميل باستخدام نفس وسائل الدفع التي
        استخدمها العميل في المعاملة الأولية. على أي حال، لن يتم تحميل أي مبلغ
        على العميل فيما يتعلق برد الأموال. يجوز لشركة فرادا حجب رد الأموال حتى
        يتم استلام المنتج المرتجع بشكل صحيح بواسطة فرادا أو حتى يوضح العميل أن
        المنتج قد تم إرجاعه بشكل صحيح، أيهما أسبق.
      </p>
      <p>
        بمجرد استلام المنتجات، ستقوم فرادا بفحصها للتحقق من توافقها مع الشروط
        والأحكام المنصوص عليها في هذا البند، وإذا كانت نتائج هذا التحقق سلبية،
        فيجب عليها إبلاغ العميل عبر البريد الإلكتروني بأن يتم تخفيض قيمة
        المنتجات المرتجعة بسبب فشل العميل في الامتثال للشروط المذكورة أعلاه.
        وبنفس الرسالة، تخطر فرادا أيضًا بالمبلغ الذي ستخصمه من المبلغ المراد
        رده، ما لم يختار العميل -على نفقته الخاصة- إعادة المنتجات إليه/إليها في
        نفس الظروف التي تم إعادتهم إلى فرادا.
      </p>
      <p>
        في حالة مصادرة حق الإلغاء، يجب على فرادا إعادة المنتج الذي تم شراؤه إلى
        العميل، مع تحميل الأخير تكاليف الشحن ذات الصلة، وسعر المنتج إذا تم رده
        بالفعل
      </p>
      <div>
        <h4>معلومات المنتج</h4>
        <p>
          ما لم يذكر خلاف ذلك، فإن الأحجام المشار إليها هي مقاسات أمريكية. يرجى
          الرجوع إلى دليل المقاسات للتوضيح.
        </p>
        <p>
          سوف تتخذ فرادا كل العناية المعقولة لضمان صحة جميع التفاصيل والأوصاف
          وأسعار المنتجات التي تظهر على الموقع في الوقت الذي تم فيه إدخال
          المعلومات ذات الصلة في النظام. نحتفظ بالحق في رفض الطلبات التي تم فيها
          نشر معلومات المنتج بشكل خاطئ، بما في ذلك الأسعار والعروض الترويجية.
        </p>
        <p>
          تقوم فرادا بتحديث متجرنا عبر الإنترنت باستمرار. من وقت لآخر، قد تقوم
          متاجر البيع بالتجزئة التابعة لشركة فرادا بتشغيل عروض ترويجية محلية
          خاصة &#34; قد لا تكون متاحة على الموقع الإلكتروني &#34;  أو قد تقدم
          فرادا خصومات خاصة عبر الإنترنت غير متوفرة في متاجر البيع بالتجزئة. قد
          لا تكون بعض العروض الترويجية لموقع الويب متاحة للعملاء في ولايات
          قضائية معينة.
        </p>
      </div>
      <div>
        <h4>إخلاء المسؤولية وحدودها</h4>
        <p>
          باستثناء ما يتم توفيره صراحةً بخلاف ذلك، يتم توفير موقع الويب وجميع
          المحتويات وجميع المنتجات والخدمات المقدمة من خلال الموقع الإلكتروني
          &#34; كما هي &#34;. تُخلي فرادا مسؤوليتها عن جميع الضمانات من أي نوع، سواء كانت
          صريحة أو ضمنية، بما في ذلك على سبيل المثال لا الحصر، الضمانات الضمنية
          لقابلية التسويق والملاءمة لغرض معين. لا تضمن فرادا أن استخدامك للموقع
          سيكون بلا انقطاع أو خالي من الأخطاء، أو أن الموقع أو الخادم الخاص به
          خالٍ من الفيروسات أو العناصر الضارة الأخرى. على الرغم من أن شركة فرادا
          تمنعها من تقديم معلومات دقيقة، إلا أنها لا تضمن أو تقدم أي إقرارات
          بخصوص دقة المعلومات أو موثوقيتها على هذا الموقع الإلكتروني. استخدامك
          للموقع على مسؤوليتك الخاصة. لا تتحمل شركة فرادا أو الكيانات التابعة
          لها أو الكيانات ذات الصلة أو مورديها أي مسؤولية تجاه أي شخص أو كيان عن
          أي خسارة أو ضرر مباشر أو غير مباشر &#34; سواء كان فعليًا أو تبعيًا أو
          عقابيًا أو خاصًا أو غير ذلك &#34; ، أو شخصية على الإطلاق بناءً على أو
          نتيجة استخدامك أو عدم قدرتك على استخدام الموقع أو أي معلومات أو مواد
          متوفرة على الموقع. فرادا ليست مسؤولة عن أي سلوك تشهيري أو عدواني أو
          غير قانوني من أي مستخدم. إذا كنت غير راضٍ عن موقع الويب أو أي مواد على
          الموقع، أو بأي من هذه الشروط، فإن الحل الوحيد والحصري هو التوقف عن
          استخدام الموقع والتمتع بخدماته أيًا كانت.
        </p>
      </div>
      <div>
        <h4>المطالبات والأسئلة / الاتصالات الإلكترونية</h4>
        <p>
          يمكن إرسال أي مطالبة أو سؤال إلى عنوان البريد الإلكتروني
          mesupport@frada.com
        </p>
      </div>
      <p>
        باستخدام موقع الويب و/أو الخدمات المقدمة على الموقع أو من خلاله، يوافق
        العميل على تلقي الاتصالات الإلكترونية من فرادا. قد تتضمن هذه الاتصالات
        الإلكترونية إشعارات حول الرسوم والتكاليف المطبقة، ومعلومات المعاملات،
        وغيرها من المعلومات المتعلقة أو المتعلقة بالموقع الإلكتروني و/أو
        المنتجات المشتراة من خلال الموقع. تعد هذه الاتصالات الإلكترونية جزءًا من
        علاقة العميل فرادا. يوافق العميل على أن أي إشعارات أو اتفاقيات أو
        إفصاحات أو اتصالات أخرى ترسلها فرادا إلى العميل إلكترونيًا سوف تفي بأي
        متطلبات اتصال قانونية، بما في ذلك أن تكون هذه الاتصالات مكتوبة.
      </p>
    </section>
  );
};

export default TermsSale;
