import "./ShippingInfo.css";
const ShippingInfo = () => {
  return (
    <section className="shipping-info-section">
      <div className="standard-shipping">
        <h4>الشحن القياسي</h4>
        <p>24 ساعة لجميع الطلبات داخل مدينة الرياض.</p>
        <p>(2-4) يومان إلى أربعة أيام للطلبات خارج الرياض وداخل مدن المملكة.</p>
      </div>
      <div className="return-shipping">
        <h4>الإسترجاع</h4>
        <p>
          الإستبدال والإسترجاع يكون متاحاً في غضون 14 يوماََ من تاريخ الشراء،
          طبقا لسياستنا.
        </p>
      </div>
      <div className="shipping-info">
        <h4>معلومات الشحن</h4>
        <p>
          سنقوم بشحن المنتج/المنتجات في طلبك عبر Aramex إلى عنوان التسليم داخل
          جميع المدن في المملكة العربية السعودية. سيطلب شريك الشحن الخاص بنا
          توقيعاََ من جانبك (أو من شخص بالغ مفوض من قبلك) عند إستلام المنتجات.
          يرجى ملاحظة أننا لن نقوم بتسليم المنتجات إلى صناديق بريد الطرف الثالث.
          سنقوم بالتوصيل فقط أثناء أيام / ساعات العمل وليس في عطلات نهاية
          الأسبوع أو العطلات الرسمية
        </p>
        <p>
          سيجري شريك الشحن محاولتين (2) للتسليم لتسليم الشحنة والحصول على
          توقيعك. التكرار هو محاولتان (2) متتاليتان واحدة كل يوم. بعد المحاولة
          الثالثة، سيتم إعادة الشحنة إلى متجر فرادا بالرياض
        </p>
        <p>
          يمكنك التحقق من تقدم طلبك من خلال الرابط الموجود في لوحة التحكم
          الخاصة بحسابك الشخصي أو عبر التواصل معنا.
        </p>
      </div>
    </section>
  );
};

export default ShippingInfo;
