import "./Cookies.css";
const Cookies = () => {
  return (
    <section className="cookies-section">
      <div>
        <h4>ما هو ملف تعريف الارتباط ولماذا يتم استخدامه؟</h4>
        <p>
          ملف تعريف الارتباط هو ملف بيانات صغير يتم إرساله في شكل رمز مُشفر،
          مجهول، وفريد إلى متصفحك من خادم الويب ليتم تخزينه على القرص الصلب
          لجهازك &#40; جهاز الكمبيوتر و / أو الهاتف الذكي و / أو الجهاز
          اللوحي &#41;. قد تسمح ملفات تعريف الارتباط بالاستخدام الصحيح لموقع
          الإنترنت &#40; ما يسمى بملفات تعريف الارتباط التقنية/الفنية &#41; أو قد
          تعمل بمثابة فحوصات وإحصائات بيانية لتفضيلات المستخدم في سياق تنقله عبر
          الإنترنت من أجل اقتراح رسائل إعلانية &#40; ما يسمى ملفات تعريف الارتباط
          التوصيفية &#41; .
        </p>
        <p>
          قد يتم تخزين ملفات تعريف الارتباط بشكل دائم على الجهاز لفترة متغيرة
          المدة &#40; ما يسمى ملفات تعريف الارتباط الدائمة &#41; أو قد يتم حذفها
          عند إغلاق المتصفح أو تكون محدودة المدة &#40; ما يسمى ملفات تعريف
          الارتباط المؤقتة للجلسة &#41;. قد يتم تثبيت ملفات تعريف الارتباط بواسطة
          موقع الويب الذي تزوره &#40; ما يسمى ملفات تعريف ارتباط الطرف الأول &#41;
          أو قد يتم تثبيتها بواسطة مواقع ويب أخرى &#40; ما يسمى ملفات تعريف
          ارتباط الطرف الثالث &#41;.
        </p>
      </div>
      <div>
        <h4>
          ملفات تعريف الارتباط المستخدمة في هذا الموقع الالكتروني وأغراض هذا
          الاستخدام
        </h4>
        <h5>يستخدم هذا الموقع ملفات تعريف الارتباط التالية:</h5>
        <h6>ملفات تعريف الارتباط الفنية</h6>
        <p>
          تسمح ملفات تعريف الارتباط هذه للموقع بالعمل بشكل صحيح مما يتيح عرض
          محتوياته باللغة والسوق ذات الصلة من أول زيارة للمستخدم. إنهم قادرون
          على التعرف على البلد الذي يقوم المستخدم منه بالاتصال/بالتصفح والتأكد
          من أن المستخدم يتم توجيهه تلقائيًا إلى إصدار مُحدد من موقع الويب
          المطبق على بلده أو بلدها في كل زيارة. كما أنها تتيح إمكانية إنشاء حساب
          وتسجيل الدخول وإدارة الطلبات. إذا كنت مستخدمًا مسجلاً، سيكون الموقع
          قادرًا على التعرف عليك عند الوصول إلى الخدمات المقدمة للمستخدمين
          المسجلين نتيجة لملفات تعريف الارتباط. يمكن لملفات تعريف الارتباط هذه
          معرفة ما إذا كان المستخدمون يشترون منتجات على موقع الويب من خلال موقع
          تابع أو شريك رسمي، مما يتيح لنا الوفاء بالتزاماتنا فيما يتعلق بهذه
          المواقع الشريكة. إن ملفات تعريف الارتباط هذه ضرورية لعمل الموقع
          بالطريقة والشكل الملائمين.
        </p>
        <h6>ملفات تعريف الارتباط التحليلية</h6>
        <p>
          تُستخدم ملفات تعريف الارتباط هذه لإنشاء تحليلات إحصائية حول الطريقة
          التي يتنقل بها المستخدمون في موقع الويب. تسمح ملفات تعريف الارتباط هذه
          ، كما حددتها زينيا، فقط بتتبع عناوين IP المجهولة &#40; مع جزء من الرمز
          غير مرئي &#41; وبالتالي لا تسمح بأي تعريف للمستخدم وجمع بيانات مجهولة
          الهوية. وبالتالي، فإن موافقتك غير مطلوبة لاستخدام ملفات تعريف الارتباط
          التحليلية المجهولة، حيث إنها لا تجمع أي بيانات شخصية ويتم التعامل معها
          بعد ذلك على أنها ملفات تعريف ارتباط تقنية.
        </p>
        <h6>ملفات تعريف الارتباط الخاصة بالطرف الأول والثالث للتوصيف</h6>
        <p>
          يستخدم موقع الويب ملفات تعريف الارتباط التوصيفية التي يمكن من خلالها
          ملاحظة التفضيلات والعادات المكتشفة للمستخدمين أثناء كل زيارة وبالتالي
          إنشاء ملفات تعريف و/أو إكمال ملف تعريف المستخدم الموجود بالفعل في
          قاعدة البيانات الخاصة بنا، مما يتيح لك إرسال رسائل أكثر تماشيًا مع
          تفضيلات المستخدمين و الإهتمامات.
        </p>
        <p>
          يتم استخدام ملفات الطرف الثالث من قبل جهات خارجية موثوقة مما يجعل من
          الممكن عرض إعلانات البانر &#40; التبويب &#41; على المواقع التابعة الأخرى
          &#40; لغرض إعادة الاستهداف &#41; مما يعرض المنتجات التي شاهدها
          المستخدمون مؤخرًا. أثناء تصفح المستخدمين للموقع، تُستخدم ملفات تعريف
          الارتباط هذه أيضًا لعرض المنتجات الأخرى التي قد تهم المستخدمين أو
          المنتجات المشابهة لتلك التي شاهدها المستخدمون للتو، على أساس جدول
          وتاريخ التصفح الخاص بهم.
        </p>
      </div>
      <div>
        <h4>الأساس القانوني لاستخدام ملفات تعريف الارتباط</h4>
        <p>
          عندما يصل المستخدمون إلى أي صفحة على موقع الويب، سيرون تبويب تعرض
          معلومات موجزة حول ملفات تعريف الارتباط. من خلال الإعلانات المبوبة، أنت
          حر في تقديم بياناتك الشخصية لأغراض التحليل للتسويق. يكمن الأساس
          القانوني لهذه المعالجة في الموافقة الممنوحة كما هو موضح في شعار موقع
          الويب ذي الصلة. لا يترتب على عدم الموافقة أي عواقب على استخدام الموقع
          &#40; باستثناء عدم تلقي أي اقتراحات أخرى للشراء &#41;.
        </p>
        <p>
          الموافقة غير مطلوبة لاستخدام ملفات تعريف الارتباط التقنية، وبالتالي
          تتم معالجتها على أساس المصلحة المشروعة للمالك/لموقع الويب لتوفير تجربة
          محسنة للتنقل والاستخدام المحسّن للموقع.
        </p>
      </div>
      <div>
        <h4>كيف تتم معالجة بياناتك الشخصية</h4>
        <p>
          ستتم معالجة بياناتك الشخصية بواسطة أدوات آلية للوقت اللازم تمامًا
          لتحقيق الأغراض التي تم جمع هذه البيانات من أجلها. برجاء العلم أنه تم
          اعتماد تدابير أمنية وتقنية وتنظيمية محددة لمنع فقدان البيانات
          والاستخدام غير المشروع أو غير الصحيح والوصول غير المصرح به..
        </p>
      </div>
      <div>
        <h4>من سيحصل على المعرفة بالبيانات ونقلها والكشف عنها</h4>
        <h5>
          البيانات التي يتم الحصول عليها من خلال ملفات تعريف الارتباط ستصل إلى
          معرفة ما يلي:
        </h5>

        <h6>
          الموظفين والمتعاونين مع لوحة التحكم، الذين يعملون بصفتهم الشخص المخول
          لإجراء المعالجة وموردي الخدمات الفنية والتنظيمية الذين يعملون في قدرة
          المعالجات.
        </h6>

        <h6>حقوق المستخدمين</h6>
        <p>
          يمكن للمستخدمين أن يطلبوا ويحصلوا -في أي وقت- على محو بياناتهم أو
          إخفاء هويتها أو نسخها أو تحديثها أو تصحيحها أو تحسين تكاملها. قد يعارض
          المستخدمون أيضًا -في أي وقت- معالجة بياناتهم الشخصية لأغراض تجارية
          وتسويقية، وكذلك معارضة معالجتها لأغراض أخرى. لأسباب مشروعة قد يطلبون
          إمكانية النقل أو القيود على معالجتهم. يحق للمستخدمين إلغاء الموافقة
          المقدمة مسبقًا.
        </p>
        <p>حق المستخدمين في فتح ملفات تعريف الارتباط أو تحريرها</p>
        <h6>المتصفح</h6>
        <p>
          يمكنك معارضة تخزين ملفات تعريف الارتباط على القرص الصلب لديك عن طريق
          تكوين متصفحك بطريقة تعطل ملفات تعريف الارتباط. لقد حددنا أدناه
          الإجراءات المتاحة في المتصفحات الرئيسية
        </p>
        <ul>
          <li>متصفح الإنترنت</li>
          <li>جوجل كروم</li>
          <li>غايرفوكس</li>
          <li>سفاري</li>
        </ul>
        <p>
          ومع ذلك، من الممكن أنه بعد إكمال العملية المذكورة أعلاه، قد لا يعمل
          عدد من وظائف صفحة الويب بشكل صحيح.
        </p>
        <h6>ملفات تعريف ارتباط الطرف الثالث</h6>
        <p>
          لمعرفة المعلومات والإجراءات الخاصة بإلغاء تنشيط ملفات تعريف الارتباط
          للجهات الخارجية، يمكنك النقر فوق الروابط الموجودة في العمود &#40; مزيد من
          المعلومات &#41;  في الجدول الذي يحتوي على قائمة ملفات تعريف الارتباط الموضحة
          أعلاه.
        </p>
        <h6>الإعلانات المبوبة</h6>
        <p>
          يمكنك فقط قبول ملفات تعريف الارتباط التقنية أو قبول جميع ملفات تعريف
          الارتباط أو إدارة تفضيلاتك من خلال اللافتة التي تحتوي على معلومات
          موجزة تتعلق بملفات تعريف الارتباط على موقع الويب. سيتم تسجيل اختياراتك
          فيما يتعلق بملفات تعريف الارتباط في &#40; ملف تعريف ارتباط تقني &#41;  محدد.
        </p>
        <p>
          لن يتم تغيير الغرض من التبويبات، الذي يمكنك من خلاله قبول ملفات تعريف
          الارتباط التقنية فقط، أو قبول جميع ملفات تعريف الارتباط أو إدارة
          تفضيلاتك فيما يتعلق بملفات تعريف الارتباط، إلا بعد مرور 6 أشهر على
          الأقل منذ العرض التقديمي السابق باستثناء
        </p>
        <ol>
          <li>في الحالات التي تغيرت فيها شروط المعالجة</li>
          <li>التصفح في وضع مجهول</li>
          <li>يتم حذف ملفات تعريف الارتباط من جهازك، كما هو موضح بالأعلي</li>
          <li>يتم الوصول من أجهزة مختلفة</li>
        </ol>
      </div>
    </section>
  );
};

export default Cookies;
