import "./TermsSite.css"
const TermsSite = () => {
    return (
        <div className="terms-site-section">
            <div>
                <h4>1-حقوق الملكية الفكرية</h4>
                <p>جميع المكونات المتوفرة عبر موقعنا الإلكتروني، بما في ذلك وليس بصورة حصرية، النصوص، الصور، العلامات التجارية، الشعارات، الرسوم البيانية، الملفات الصوتية والمرئية، والبرمجيات، بالإضافة إلى تصميم وتنظيم الموقع، محمية قانوناً بموجب حقوق النشر وحقوق الملكية الفكرية التي تحتفظ بها شركة فرادا أو الأطراف الثالثة التي لديها  إتفاقيات مع فرادا. يُحظر نسخ أو إعادة توزيع الموقع أو أي جزء من محتوياته بدون الحصول على إذن كتابي صريح من فرادا.</p>
                <br />
                <p>كمستخدم، يُتاح لك فرصة الإطلاع على الموقع وإستخدام المحتوى والخدمات المقدمة فيه وفقاً للشروط المحددة. يُسمح لك بإجراء تعديلات مؤقتة وغير جوهرية، طالما أن هذه التغييرات لا تحمل قيمة إقتصادية مستقلة وتُعتبر ضرورية للتصفح وإستخدام الموقع بشكل قانوني. لا يجوز إستخدام الموقع أو أي من محتوياته بطريقة كاملة أو جزئية دون إذن مسبق.</p>
                <br />
                <p>أية تعديلات على المحتوى أو البيانات يجب أن تحصل على موافقة من فرادا، أو عند الضرورة، من المؤلفين أو المالكين للأعمال المعنية. هذه الإجراءات يجب أن تتم في إحترام تام للقوانين المتعلقة بحقوق النشر وحقوق الملكية الفكرية لفرادا وللمؤلفين.</p>
                <br />
                <p>يحق لأصحاب المحتوى طلب حقوق المؤلف لأعمالهم في أي وقت والاعتراض على أي تعديلات قد تشوه أو تضر بمحتوياتهم أو تؤثر سلبًا على سمعتهم. يجب عليك كمستخدم إحترام حقوق الملكية الفكرية وعدم إستخدام المحتوى المحمي بطرق تخالف هذه الحقوق. لا يسمح بأي تغييرات على الأعمال المحمية دون موافقة صريحة من فرادا أو الأطراف المعنية.</p>
            </div>
            <div>
                <h4>2-العلامات التجارية ونطاقات الويب</h4>
                <p>
                    شركة كبار الشخصيات التجارية تمتلك الحقوق الحصرية لجميع العلامات التجارية المستخدمة على موقع فرادا لتمييز منتجاتها. هذه العلامات محمية قانونيًا ويُمنع بشكل قاطع إستخدامها بدون إذن مكتوب وصريح من الشركة. الإستخدام غير المصرح به قد يؤدي إلى تبعات قانونية.
                </p>
                <br />
                <p>
                    لا يُسمح باستخدام هذه العلامات التجارية بأي شكل يمكن أن يُفهم على أنه إستغلال لسمعة علامات فرادا أو يضر بالشركة نفسها أو بأصحاب الحقوق. هذا يشمل الإستخدام غير المباشر أو الإستفادة من الشهرة التي تتمتع بها العلامات التجارية لأغراض غير ملائمة.
                </p>
                <br />
                <p>
                    أما بالنسبة لنطاق frada.com.sa وأي من نطاقاته الفرعية، فهي تعود ملكيتها بالكامل لمجموعة فرادا وشركة كبار الشخصيات التجارية. الإستخدام غير المصرح به لهذه النطاقات، سواء بشكل مباشر أو غير مباشر، محظور بدون موافقة مكتوبة من الأصحاب.
                </p>
                <br />
                <p>
                    للحصول على المزيد من المعلومات أو لطلب إذن بإستخدام هذه العلامات التجارية أو النطاقات، يرجى التواصل مع فرادا مباشرة عبر المعلومات المتوفرة على الموقع الإلكتروني.
                </p>
            </div>
            <div>
                <h4>
                    3-روابط الطرف الثالث سواء كانت مصدر لزيارة فرادا، أو روابط خارجية لزيارة مواقع الطرف الثالث
                </h4>

                <h5>الروابط الخارجية:</h5>
                <p>
                    موقع فرادا قد يحتوي على روابط لمواقع إلكترونية أخرى لا تتحكم فيها أو تمتلكها مجموعة فرادا. هذه المواقع الخارجية لا تخضع لسياساتنا ولا نستطيع ضمان سلامتها أو محتواها. بالتالي، يُنصح بشدة بأن يقوم المستخدمون بقراءة شروط الإستخدام وسياسات الخصوصية لأي موقع يزورونه عبر هذه الروابط بعناية.
                </p>
                <h5>
                    تفعيل روابط الطرف الثالث:
                </h5>
                <p>
                    لإنشاء رابط يوجه إلى موقع فرادا، يجب الحصول على موافقة مسبقة من مشغل الموقع. يمكن تقديم طلبات الموافقة عبر العنوان البريدي أو البريد الإلكتروني المذكور في موقعنا. الروابط التي يتم تنشيطها دون هذه الموافقة قد تؤدي إلى إتخاذ مشغل الموقع لإجراءات قانونية لإزالة هذه الروابط.
                </p>
                <h5>
                    الروابط العميقة والعلامات الوصفية:
                </h5>
                <p>
                    يُحظر نشر الروابط العميقة التي توجه مباشرة إلى صفحات داخلية بدون المرور بالصفحة الرئيسية لموقع فرادا، كما يُحظر استخدام العلامات الوصفية (meta tags) غير المصرح بها التي تستغل إسم أو علامات فرادا. أي تجاوز لهذه القواعد يعتبر خرقًا للقوانين وقد يؤدي إلى إتخاذ إجراءات قانونية.
                </p>
                <h5>
                    التأثيرات القانونية:
                </h5>
                <p>
                    أي إستخدام غير مصرح به للروابط قد يعرض الجهة المخالفة لمخاطر قانونية تشمل الدعاوى القضائية والمطالبات بتعويضات بسبب المنافسة غير العادلة أو التأثير السلبي على السمعة.
                </p>
                <p>
                    يجب على المستخدمين والأطراف الثالثة التعامل مع هذه الإرشادات بجدية لضمان تفاعل آمن وقانوني مع محتويات وروابط موقع فرادا.
                </p>
            </div>
            <div>
                <h4>
                    4-المحتوى
                </h4>
                <h5>
                    إستخدام الموقع لأغراض شخصية
                </h5>
                <p>
                    يُصمم موقع فرادا للإستخدام الشخصي فقط. يُحظر إستخدام الموقع لأغراض تجارية أو مهنية دون الحصول على موافقة خطية مسبقة من إدارة موقع فرادا. إستخدام الموقع يعني مسؤوليتك الشخصية عن أي نتائج قد تنجم عن إستخدام غير لائق.
                </p>
                <h5>
                    تحمل المسئولية
                </h5>
                <p>
                    لا يتحمل مشغل موقع فرادا أي مسؤولية عن الأضرار التي قد تنجم عن استخدام الموقع، بما في ذلك تلف الأجهزة الإلكترونية أو فقدان البيانات، ما لم ينجم ذلك عن إهمال جسيم أو سوء سلوك متعمد من قبل إدارة الموقع. كما لا يتحمل مشغل الموقع أي مسؤولية عن إنقطاع الخدمة أو مشاكل الإتصال.
                </p>
                <h5>
                    حماية البيانات
                </h5>
                <p>
                    أنت مسؤول عن حماية بياناتك الشخصية وإستخدامها بطريقة آمنة. يجب أن تكون مسؤولاً أيضاً عن أي نتائج قد تنجم عن إستخدام غير صحيح أو فقدان أو سرقة بياناتك.
                </p>
                <h5>
                    المحتوى المسيء
                </h5>
                <p>
                    إذا وجدت محتوى يعتبر مسيئاً أو ينتهك الكرامة الشخصية، يُرجى إبلاغ مشغل الموقع عبر البريد الإلكتروني customer.care@frada.com ومع ذلك، يُعتبر الوصول إلى مثل هذه المحتويات عملاً متعمداً من قبلك وأنت المسؤول الوحيد عن ذلك.
                </p>
                <h5>
                    دقة المعلومات
                </h5>
                <p>
                    بالرغم من أن مشغل موقع فرادا يتخذ كل الإحتياطات اللازمة لضمان دقة وإكتمال وتحديث المعلومات المقدمة على الموقع، لا يتحمل مسؤولية عن أي أخطاء أو عدم إكتمال المعلومات. إذا إكتشفت أي خطأ، يُرجى إبلاغ إدارة الموقع عبر البريد الإلكتروني المذكور أعلاه.
                </p>
                <p>
                    يُنصح بأن يقوم المستخدمون بقراءة هذه السياسات بعناية لفهم حقوقهم ومسؤولياتهم بشكل كامل عند إستخدام موقع فرادا.
                </p>
            </div>
            <div>
                <h4>5-القانون المُتبع وعمليات تسوية المنازعات القانونية في موقع فرادا السعودي</h4>
                <h5>
                    التطبيق القانوني
                </h5>
                <p>
                    جميع الأنشطة والتعاملات التي تُجرى عبر موقع فرادا السعودي تخضع للقوانين المعمول بها في المملكة العربية السعودية. نظرًا لعمليات الإنشاء والتشغيل والتطوير التي تديرها شركة إنفاجلو، فإن أي نزاعات قانونية أو مشكلات تعاقدية تُحل وفقاً للتشريعات السعودية
                </p>
                <h5>
                    تسوية المنازعات
                </h5>
                <p>
                    في حال نشوء أي نزاعات أو مشكلات قانونية مرتبطة بإستخدام موقع فرادا، يُنصح الأطراف المعنية بمحاولة حل النزاع بطريقة ودية أولاً. إذا لم يتم الوصول إلى حل عن طريق التفاوض المباشر، يمكن للأطراف التقدم بالقضية إلى المحاكم المختصة في المملكة العربية السعودية لتسوية النزاع.
                </p>
                <h5>الإتصال بشركة إنفاجلو</h5>
                <p>
                    لأية إستفسارات أو مساعدة قانونية يمكن التواصل مع شركة إنفاجلو، المشغلة لموقع فرادا، من خلال الوسائل التالية:
                </p>
                <p>
                    <span>البريد الإلكتروني:</span>
                    <span>info@envaglo.com</span>
                </p>
                <p>
                    <span>
                        الهاتف:
                    </span>
                    <span>
                        201200022309+
                    </span>
                    {" - "}
                    <span>
                        201200022304+
                    </span>
                </p>
                <p>يُعتبر إلتزام الأطراف بالقوانين السعودية وسياسات الموقع مهمًا لضمان تجربة مستخدم عادلة وآمنة.</p>
            </div>
        </div>
    )
}

export default TermsSite
