import "./Faq.css";
import { Accordion } from "react-bootstrap";
import Link from "next/link";
const Faq = () => {
  return (
    <section className="faq-section">
      <Accordion>
        <Accordion.Item className="faq-products-orders" eventKey="0">
          <Accordion.Header>المنتجات والطلبات</Accordion.Header>
          <Accordion.Body>
            <div>
              <h4>كيف أجد هذا المنتج؟</h4>
              <p>يمكنك تحديد منتج معين عن طريق</p>
              <ol>
                <li>الضغط على أيقونة البحث وإدخال إسم المنتج أو وصفه.</li>
                <li>
                  الضغط على الخيارات الموجودة في الجزء العلوي من الموقع وإختيار
                  التصفية من هناك: هدايا جاهزة للإرتداء والإستمتاع، والمزيد
                </li>
                <li>
                  الإتصال بفريقنا لخدمة العملاء للحصول على مزيد من المساعدة
                  بإستخدام الرابط التالي
                  <Link href="/services/contact-us">:تواصل معنا</Link>
                </li>
              </ol>
            </div>
            <div>
              <h4>أين طلبي؟</h4>
              <p>
                سيتم إرسال بريد إلكتروني للتأكيد، ستحتوي رسالة البريد الالكتروني
                على تفاصيل طلبك ورقمه بمجرد تقديم طلبك. يُرجى الإنتظار ما بين
                24-48 ساعة لإعطاء فرصة لفريقنا حتى يتم تحضير طلبك.
              </p>
              <p>
                يمكنك التحقق من حالة طلبك من خلال زيارة &#34;طلباتي&#34; على حساب متجر
                فرادا الخاص بك لعرض حالة طلبك/طلباتك ومعلومات التسليم.
              </p>
              <p>
                بمجرد أن يصبح طلبك جاهزاََ للشحن، سيتم إرسال بريد إلكتروني يحتوي
                على معلومات التتبع لطلبك.
              </p>
              <p>
                إذا لم تكن قد تلقيت رسالة البريد الإلكتروني الخاص بك، فيرجى
                التحقق أولاً من مجلد البريد غير الهام (Junk أو Spam) الخاص بك.
                إذا كنت لا تزال غير قادر على تحديد موقع رسالة البريد الإلكتروني
                المرسلة، فقد لا يكون طلبك جاهزاََ للشحن بعد.
              </p>
              <p>
                إذا لم تستلم طلبك خلال فترة التسليم المحددة، فيرجى الاتصال
                بفريقنا لخدمة العملاء بإستخدام الرابط التالي
                <Link href="/services/contact-us">:تواصل معنا</Link>
              </p>
            </div>
            <div>
              <h4>لماذا تم إلغاء طلبي؟</h4>
              <p>
                خلال فترات الذروة، مثل فترات البيع الكثيف لدينا (مثل أوقات
                الأعياد أو المناسبات العامة)، قد يكون هناك توافر محدود للمخزون.
                قد يتم إلغاء جزء من طلبك أو الطلب بأكمله بسبب هذا.
              </p>
              <p>
                يمكن لأنظمة الأمان المصرفية وبروتوكولات التحقق من الإحتيال لدينا
                وإيقاف المعاملات لمجموعة متنوعة من الأسباب، من عدم مناسبة
                البطاقة لأي سبب إلى أمان إتصال الإنترنت.
              </p>
              <p>
                يرجى التأكد من أننا لا نخصم/نستلم أي مبالغ مادية حتى يتم شحن
                الطلب.
              </p>
              <p>
                في هذه الحالات، سيرسل فريق خدمة العملاء لدينا رسالة بريد
                إلكتروني لإعلامك بأي تغييرات قد تطرأ على طلبك.
              </p>
            </div>

            <div>
              <h4>هل يمكنني إلغاء أو تعديل تفاصيل طلبي؟</h4>
              <p>
                بمجرد تقديم الطلب، يعمل فريقنا بسرعة لتجهيز طلبك وشحنه. لهذا
                السبب، لا يمكننا قبول الإلغاءات أو التغييرات في طلبك.
              </p>
              <p>
                يتضمن هذا التغييرات على المنتجات وتفاصيل الشحن. إذا غيرت رأيك،
                فيحق لك إرجاع طلبك. يمكن الإطلاع على تفاصيل الإرجاع الكاملة
                باستخدام الرابط التالي:
                <Link href="/services/returns-and-refunds">الإستبدال والإسترجاع</Link>
              </p>
            </div>
            <div>
              <h4>منتجي به مشكلة أو تلف، ماذا أفعل؟</h4>
              <p>
                يمكنك الاتصال بفريقنا باستخدام الرابط التالي:
                <Link href="/services/contact-us">:تواصل معنا</Link>.
              </p>
              <p>يرجى التأكد من أن لديك المعلومات التالية لتسليمها:</p>
              <ol>
                <li>صورة توضح المنتج بالكامل وصورة توضح المشكلة المحددة</li>
                <li>رمز أو كود المنتج</li>
                <li>
                  إثبات الشراء للمنتج، إن وجد. بدلًا من ذلك، يمكنك توفير معلومات
                  موقع وتاريخ الشراء إذا لم يكن إثبات شراء المنتج متاح. عنوانك
                  الحالي ورقم هاتفك
                </li>
              </ol>
            </div>
          </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item className="faq-payments" eventKey="1">
          <Accordion.Header>المدفوعات</Accordion.Header>
          <Accordion.Body>
            <div>
              <h4>ما هي وسائل الدفع التي نوفرها لك؟</h4>
              <p>الدفع عن طريق البطاقات الإتمانية Visa و Mastercard.</p>
              <p>الدفع عن طريق بطاقات مدى الإتمانية وخدمة Apple Pay.</p>
              <p>الدفع بالتقسيط عن طريق خدمة تابي.</p>
            </div>
            <div>
              <h4>كيف يمكنني الدفع مقابل طلبي؟</h4>
              <p>
                سيتم إرسال بريد إلكتروني للتأكيد، ستحتوي رسالة البريد الالكتروني
                على تفاصيل طلبك ورقمه بمجرد تقديم طلبك. يُرجى الإنتظار ما بين
                24-48 ساعة لإعطاء فرصة لفريقنا حتى يتم تحضير طلبك.
              </p>
              <p>
                يمكنك التحقق من حالة طلبك من خلال زيارة &#34;طلباتي&#34; على حساب متجر
                فرادا الخاص بك لعرض حالة طلبك/طلباتك ومعلومات التسليم.
              </p>
              <p>
                بمجرد أن يصبح طلبك جاهزاََ للشحن، سيتم إرسال بريد إلكتروني يحتوي
                على معلومات التتبع لطلبك.
              </p>
              <p>
                إذا لم تكن قد تلقيت رسالة البريد الإلكتروني الخاص بك، فيرجى
                التحقق أولاً من مجلد البريد غير الهام (Junk أو Spam) الخاص بك.
                إذا كنت لا تزال غير قادر على تحديد موقع رسالة البريد الإلكتروني
                المرسلة، فقد لا يكون طلبك جاهزاََ للشحن بعد.
              </p>
              <p>
                إذا لم تستلم طلبك خلال فترة التسليم المحددة، فيرجى الاتصال
                بفريقنا لخدمة العملاء بإستخدام الرابط التالي
                <Link href="/services/contact-us">:تواصل معنا</Link>
              </p>
            </div>
            <div>
              <h4>
                كيف يمكنني إصلاح خطأ (الدفع، الفني، إتمام الدفع) عند محاولة
                تقديم طلب؟
              </h4>
              <p>
                إذا كنت تواجه صعوبات في تقديم طلب عبر الإنترنت، فإننا نوصي
                بالاتصال بالمصرف الذي تتعامل معه مباشرةً للتحقق مما إذا كان ذلك
                بسبب مشكلة في طريقة الدفع التي اخترتها.
              </p>
              <p>
                إذا تحقق وسيط الدفع الخاص بك من أن هذه ليست المشكلة، فالرجاء
                محاولة إجراء واحد أو أكثر من الخطوات التالية:
              </p>
              <ul>
                <li>استخدم طريقة دفع بديلة.</li>
                <li>
                  احذف ملفات المتصفح المؤقتة المخزنة (Cache) وملفات تعريف
                  الارتباط (Cookies)، ثم قم بتحديث الصفحة.
                </li>
                <li>
                  كرر عملية الشراء بالكامل باستخدام متصفح مختلف من بين
                  المتصفحات: Google أو Chrome أو Mozilla Firefox، أو Safari،
                  وإذا أمكن، من جهاز كمبيوتر محمول أو كمبيوتر مكتبي مختلف.
                </li>
              </ul>
              <p>
                قد تكون الأسباب الأخرى للمشكلة مرتبطة بإدخال تفاصيل العنوان.
                يرجى التأكد من أنك تستخدم الأحرف اللغوية الهجائية فقط. لا تستخدم
                الرموز أو علامات الترقيم في العنوان.
              </p>
            </div>
          </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item className="faq-shipping-info" eventKey="2">
          <Accordion.Header>معلومات الشحن</Accordion.Header>
          <Accordion.Body>
            <div>
              <h4>ما هي خيارات التسليم والمواعيد المتاحة؟</h4>
              <p>
                سنقوم بشحن المنتج/المنتجات في طلبك عبر Aramex إلى عنوان التسليم
                داخل جميع المدن في المملكة العربية السعودية. سيطلب شريك الشحن
                الخاص بنا توقيعاََ من جانبك (أو من شخص بالغ مفوض من قبلك) عند
                إستلام المنتجات. يرجى ملاحظة أننا لن نقوم بتسليم المنتجات إلى
                صناديق بريد الطرف الثالث. سنقوم بالتوصيل فقط أثناء أيام / ساعات
                العمل وليس في عطلات نهاية الأسبوع أو العطلات الرسمية
              </p>
              <p>
                سيجري شريك الشحن محاولتين (2) للتسليم لتسليم الشحنة والحصول على
                توقيعك. التكرار هو محاولتان (2) متتاليتان واحدة كل يوم. بعد
                المحاولة الثالثة، سيتم إعادة الشحنة إلى متجر فرادا بالرياض
              </p>
              <p>
                يمكنك التحقق من تقدم طلبك من خلال الرابط الموجود في لوحة التحكم
                الخاصة بحسابك الشخصي أو عبر التواصل معنا.
              </p>
            </div>
          </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item className="faq-returns-refunds" eventKey="3">
          <Accordion.Header>العوائد والمرتجعات</Accordion.Header>
          <Accordion.Body>
            <div>
              <p>
                في غضون 14 يومًا – يرجى التحقق من سياسة الإرجاع لدينا من خلال
                هذا
                <Link href="/services/returns-and-refunds">الإستبدال والإسترجاع</Link>
              </p>
            </div>
          </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item className="faq-privacy-account" eventKey="4">
          <Accordion.Header>الحساب والخصوصية</Accordion.Header>
          <Accordion.Body>
            <div>
              <h4>كيف أقوم بإنشاء حساب؟</h4>
              <p>
              لإنشاء حساب بمتجر فرادا يرجى الضغط على الرابط التالي:
                <Link href="/register">إنشاء حساب</Link>
              </p>
            </div>
          </Accordion.Body>
        </Accordion.Item>
      </Accordion>
    </section>
  );
};

export default Faq;
